app/controllers/history_points_controller.rb

SELECT * FROM "history_points" WHERE (time between 'Sat Jul 03 18:42:00 +0800 2010' and 'Sat Jul 03 18:42:00 +0800 2010' and latitude between 2 and 1 and longitude between 2 and 1)
---
  def index
    @history_points = HistoryPoint.find_history_points(params)

SELECT * FROM "history_points" WHERE ("history_points"."id" = 0)
---
  def show
    @history_point = HistoryPoint.find(params[:id])

SELECT * FROM "history_points" WHERE ("history_points"."id" = 1)
---
  def edit
    @history_point = HistoryPoint.find(params[:id])

INSERT INTO "history_points" ("latitude", "updated_at", "time", "longitude", "created_at") VALUES(1.0, '2010-07-03 10:47:15', '2010-07-03 10:42:00', 2.0, '2010-07-03 10:47:15')
---
  def create
    @history_point = HistoryPoint.new(params[:history_point])

    respond_to do |format|
      if @history_point.save

SELECT * FROM "history_points" WHERE ("history_points"."id" = 4)
---
  def update
    @history_point = HistoryPoint.find(params[:id])